_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 143, 179, 148, 1)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 143, 179, 148, 16) 448       
_________________________________________________________________
dropout_1 (Dropout)          (None, 143, 179, 148, 16) 0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 143, 179, 148, 16) 64        
_________________________________________________________________
activation_1 (Activation)    (None, 143, 179, 148, 16) 0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 72, 90, 74, 16)    6928      
_________________________________________________________________
dropout_2 (Dropout)          (None, 72, 90, 74, 16)    0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 72, 90, 74, 16)    64        
_________________________________________________________________
activation_2 (Activation)    (None, 72, 90, 74, 16)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 72, 90, 74, 32)    13856     
_________________________________________________________________
dropout_3 (Dropout)          (None, 72, 90, 74, 32)    0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 72, 90, 74, 32)    128       
_________________________________________________________________
activation_3 (Activation)    (None, 72, 90, 74, 32)    0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 36, 45, 37, 32)    27680     
_________________________________________________________________
dropout_4 (Dropout)          (None, 36, 45, 37, 32)    0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 36, 45, 37, 32)    128       
_________________________________________________________________
activation_4 (Activation)    (None, 36, 45, 37, 32)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 36, 45, 37, 32)    27680     
_________________________________________________________________
dropout_5 (Dropout)          (None, 36, 45, 37, 32)    0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 36, 45, 37, 32)    128       
_________________________________________________________________
activation_5 (Activation)    (None, 36, 45, 37, 32)    0         
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 18, 23, 19, 32)    27680     
_________________________________________________________________
dropout_6 (Dropout)          (None, 18, 23, 19, 32)    0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 18, 23, 19, 32)    128       
_________________________________________________________________
activation_6 (Activation)    (None, 18, 23, 19, 32)    0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 18, 23, 19, 64)    55360     
_________________________________________________________________
dropout_7 (Dropout)          (None, 18, 23, 19, 64)    0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 18, 23, 19, 64)    256       
_________________________________________________________________
activation_7 (Activation)    (None, 18, 23, 19, 64)    0         
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 9, 12, 10, 64)     110656    
_________________________________________________________________
dropout_8 (Dropout)          (None, 9, 12, 10, 64)     0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 9, 12, 10, 64)     256       
_________________________________________________________________
activation_8 (Activation)    (None, 9, 12, 10, 64)     0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 9, 12, 10, 64)     110656    
_________________________________________________________________
dropout_9 (Dropout)          (None, 9, 12, 10, 64)     0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 9, 12, 10, 64)     256       
_________________________________________________________________
activation_9 (Activation)    (None, 9, 12, 10, 64)     0         
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 5, 6, 5, 64)       110656    
_________________________________________________________________
dropout_10 (Dropout)         (None, 5, 6, 5, 64)       0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 5, 6, 5, 64)       256       
_________________________________________________________________
activation_10 (Activation)   (None, 5, 6, 5, 64)       0         
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 5, 6, 5, 32)       55328     
_________________________________________________________________
dropout_11 (Dropout)         (None, 5, 6, 5, 32)       0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 5, 6, 5, 32)       128       
_________________________________________________________________
activation_11 (Activation)   (None, 5, 6, 5, 32)       0         
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 3, 3, 3, 32)       27680     
_________________________________________________________________
dropout_12 (Dropout)         (None, 3, 3, 3, 32)       0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 3, 3, 3, 32)       128       
_________________________________________________________________
activation_12 (Activation)   (None, 3, 3, 3, 32)       0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 3, 3, 3, 16)       528       
_________________________________________________________________
dropout_13 (Dropout)         (None, 3, 3, 3, 16)       0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 3, 3, 3, 16)       64        
_________________________________________________________________
activation_13 (Activation)   (None, 3, 3, 3, 16)       0         
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 2, 2, 2, 16)       272       
_________________________________________________________________
dropout_14 (Dropout)         (None, 2, 2, 2, 16)       0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 2, 2, 2, 16)       64        
_________________________________________________________________
activation_14 (Activation)   (None, 2, 2, 2, 16)       0         
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 2, 2, 2, 2)        34        
_________________________________________________________________
dropout_15 (Dropout)         (None, 2, 2, 2, 2)        0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 2, 2, 2, 2)        8         
_________________________________________________________________
activation_15 (Activation)   (None, 2, 2, 2, 2)        0         
_________________________________________________________________
global_average_pooling3d_1 ( (None, 2)                 0         
_________________________________________________________________
activation_16 (Activation)   (None, 2)                 0         
=================================================================
Total params: 577,498
Trainable params: 576,470
Non-trainable params: 1,028
_________________________________________________________________
